lib/tasks/dev.rake

SELECT  "coins".* FROM "coins" WHERE "coins"."description" = ? AND "coins"."acronym" = ? AND "coins"."url_image" = ? LIMIT ?  [["description", "Bitcoin"], ["acronym", "BTC"], ["url_image", "http://pngimg.com/uploads/bitcoin/bitcoin_PNG47.png"], ["LIMIT", 1]]
SELECT  "mining_types".* FROM "mining_types" WHERE "mining_types"."acronym" = ? LIMIT ?  [["acronym", "Pow"], ["LIMIT", 1]]
SELECT "mining_types".* FROM "mining_types"
INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at", "mining_type_id") VALUES (?, ?, ?, ?, ?, ?)
---
  task add_coins: :environment do
    show_spinner('Inserindo Registros - Moedas...') do

      coins =
        [
          {
            description: "Bitcoin",
            acronym: "BTC",
            url_image: 'http://pngimg.com/uploads/bitcoin/bitcoin_PNG47.png',
            mining_type: MiningType.find_by(acronym: "PoW")
          },
          {
            description: "Ethereum",
            acronym: "ETH",
            url_image: 'https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/ETHEREUM-YOUTUBE-PROFILE-PIC.png/600px-ETHEREUM-YOUTUBE-PROFILE-PIC.png',
            mining_type: MiningType.all.sample
          },

          {
            description: "Dash",
            acronym: "DASH",
            url_image: 'https://banner2.kisspng.com/20180402/xrq/kisspng-dash-bitcoin-litecoin-cryptocurrency-ethereum-dash-5ac20b52903587.5621313815226663225907.jpg',
            mining_type: MiningType.all.sample
          }
        ]

      coins.each do |coin|
        Coin.find_or_create_by(coin);

INSERT INTO "mining_types" ("description", "acronym", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Proof of Work"], ["acronym", "PoW"], ["created_at", "2018-12-02 23:05:25.914288"], ["updated_at", "2018-12-02 23:05:25.914288"]]
---
  task add_mining_types: :environment do
    show_spinner('Inserindo Registros - Tipos de Mineração...') do

      mining_types =
        [
          {
            description: "Proof of Work",
            acronym: "PoW",
          },
          {
            description: "Proof of Stake",
            acronym: "PoS"
          },

          {
            description: "Proof of Capacity",
            acronym: "PoC"
          }
        ]

      mining_types.each do |mining_type|
        MiningType.find_or_create_by(mining_type);