app/controllers/coins_controller.rb

INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at", "mining_type_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @coin = Coin.new(coin_params)

    respond_to do |format|
      if @coin.save

UPDATE "coins" SET "url_image" = ?, "updated_at" = ? WHERE "coins"."id" = ?  [["url_image", "http://pngimg.com/uploads/bitcoin/bitcoin_PNG47.png"], ["updated_at", "2018-12-01 15:54:37.913364"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @coin.update(coin_params)

SELECT "mining_types"."description", "mining_types"."id" FROM "mining_types"
---
    def set_mining_type_options
      @mining_type_options = MiningType.all.pluck(:description, :id)