app/controllers/personals_controller.rb

  def index
    @personals = Personal.all
---
SELECT "personals".* FROM "personals"

  def create
    @personal = Personal.new(personal_params)

    respond_to do |format|
      if @personal.save
---
INSERT INTO "personals" ("description", "age", "sex", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "Luis Carlos de Souza"], ["age", 0], ["sex", "Masculino"], ["created_at", "2018-12-01 06:12:35.771261"], ["updated_at", "2018-12-01 06:12:35.771261"]]

  def update
    respond_to do |format|
      if @personal.update(personal_params)
---
UPDATE "personals" SET "age" = ?, "updated_at" = ? WHERE "personals"."id" = ?  [["age", 23], ["updated_at", "2018-12-01 06:12:43.740557"], ["id", 1]]

    def set_personal
      @personal = Personal.find(params[:id])
---
SELECT  "personals".* FROM "personals" WHERE "personals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]